bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
// Copyright 2022-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define TRX__ADDR (SOC_TRX_REG_BASE + (0x0 << 2))

#define TRX__NC_0_31_POS (0)
#define TRX__NC_0_31_MASK (0xffffffff)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ADDR (SOC_TRX_REG_BASE + (0x1 << 2))

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BYPASS_OPT_POS (0)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BYPASS_OPT_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_MANUAL_BAND_POS (1)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_MANUAL_BAND_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BP_IBIAS_POS (2)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BP_IBIAS_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_VSEL1V_VCOLDO_POS (3)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_VSEL1V_VCOLDO_MASK (0x7)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_EDGESEL_NCK_POS (6)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_EDGESEL_NCK_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ICPOFFSET_TX_POS (7)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ICPOFFSET_TX_MASK (0x3f)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ITUNE_MIXER_POS (13)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ITUNE_MIXER_MASK (0x7)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ICPOFFSET_RX_POS (16)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_ICPOFFSET_RX_MASK (0x3f)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_CTUNE_LPF_POS (22)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_CTUNE_LPF_MASK (0x3f)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_NLOAD_DLYEN_POS (28)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_NLOAD_DLYEN_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_CALDONE_SPI_POS (29)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_CALDONE_SPI_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BYPASS_CALDONE_POS (30)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_BYPASS_CALDONE_MASK (0x1)

#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_VCTRL_CAL_POS (31)
#define TRX_CONTROLLING THE VOLTAGE OF CALIBRATION_VCTRL_CAL_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_ADDR (SOC_TRX_REG_BASE + (0x2 << 2))

#define TRX_ENABLE VCO IN THE TOP BY SPI_CK2XEN_POS (0)
#define TRX_ENABLE VCO IN THE TOP BY SPI_CK2XEN_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_CLKSEL_CAL_POS (1)
#define TRX_ENABLE VCO IN THE TOP BY SPI_CLKSEL_CAL_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_BANDCAL_SPI_POS (2)
#define TRX_ENABLE VCO IN THE TOP BY SPI_BANDCAL_SPI_MASK (0x3ff)

#define TRX_ENABLE VCO IN THE TOP BY SPI_BAND_SPI_TRGGER_POS (12)
#define TRX_ENABLE VCO IN THE TOP BY SPI_BAND_SPI_TRGGER_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_ICP_BIAS_COM_POS (13)
#define TRX_ENABLE VCO IN THE TOP BY SPI_ICP_BIAS_COM_MASK (0x3)

#define TRX_ENABLE VCO IN THE TOP BY SPI_HVREF_POS (15)
#define TRX_ENABLE VCO IN THE TOP BY SPI_HVREF_MASK (0x3)

#define TRX_ENABLE VCO IN THE TOP BY SPI_LVREF_POS (17)
#define TRX_ENABLE VCO IN THE TOP BY SPI_LVREF_MASK (0x3)

#define TRX_ENABLE VCO IN THE TOP BY SPI_DONE_DELAY_POS (19)
#define TRX_ENABLE VCO IN THE TOP BY SPI_DONE_DELAY_MASK (0x7)

#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPTRIGGER_POS (22)
#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPTRIGGER_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPAUTOCAL_POS (23)
#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPAUTOCAL_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPCAL_EN_POS (24)
#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPCAL_EN_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPCTRL_M_POS (25)
#define TRX_ENABLE VCO IN THE TOP BY SPI_AMPCTRL_M_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_ERRDET_EN_POS (26)
#define TRX_ENABLE VCO IN THE TOP BY SPI_ERRDET_EN_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_ERRDET_SPIEN_POS (27)
#define TRX_ENABLE VCO IN THE TOP BY SPI_ERRDET_SPIEN_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_VSEL1V_PLLLDO_POS (28)
#define TRX_ENABLE VCO IN THE TOP BY SPI_VSEL1V_PLLLDO_MASK (0x3)

#define TRX_ENABLE VCO IN THE TOP BY SPI_PLLEN_POS (30)
#define TRX_ENABLE VCO IN THE TOP BY SPI_PLLEN_MASK (0x1)

#define TRX_ENABLE VCO IN THE TOP BY SPI_VCOEN_POS (31)
#define TRX_ENABLE VCO IN THE TOP BY SPI_VCOEN_MASK (0x1)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ADDR (SOC_TRX_REG_BASE + (0x3 << 2))

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_CTUNE_MIXER_CH_POS (0)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_CTUNE_MIXER_CH_MASK (0xf)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_CTUNE_MIXER_POS (4)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_CTUNE_MIXER_MASK (0x3f)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_AMPSELU_POS (10)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_AMPSELU_MASK (0x7)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ICPBIAS_RX_POS (13)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ICPBIAS_RX_MASK (0x1)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ICPBIAS_TX_POS (14)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ICPBIAS_TX_MASK (0x1)

#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ITUNE_VCO_SPI_POS (15)
#define TRX_CONTROLLING THE BIAS CURRENT OF VCO_ITUNE_VCO_SPI_MASK (0x1ffff)

