bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
#define TRX_LOOP INT MODE ENABLE_ADDR (SOC_TRX_REG_BASE + (0x4 << 2))

#define TRX_LOOP INT MODE ENABLE_ICPBIAS_RX_POS (0)
#define TRX_LOOP INT MODE ENABLE_ICPBIAS_RX_MASK (0xf)

#define TRX_LOOP INT MODE ENABLE_ICPBIAS_TX_POS (4)
#define TRX_LOOP INT MODE ENABLE_ICPBIAS_TX_MASK (0xf)

#define TRX_LOOP INT MODE ENABLE_AMPSEL_POS (8)
#define TRX_LOOP INT MODE ENABLE_AMPSEL_MASK (0x1f)

#define TRX_LOOP INT MODE ENABLE_BYPASS_AAC_POS (13)
#define TRX_LOOP INT MODE ENABLE_BYPASS_AAC_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_RESET_SPI_POS (14)
#define TRX_LOOP INT MODE ENABLE_RESET_SPI_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_NRSTEN_POS (15)
#define TRX_LOOP INT MODE ENABLE_NRSTEN_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_TRISTATE_SPI_POS (16)
#define TRX_LOOP INT MODE ENABLE_TRISTATE_SPI_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_SELVCOPOL_POS (17)
#define TRX_LOOP INT MODE ENABLE_SELVCOPOL_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_NCLKEN_SPI_POS (18)
#define TRX_LOOP INT MODE ENABLE_NCLKEN_SPI_MASK (0x1)

#define TRX_LOOP INT MODE ENABLE_NINT_POS (19)
#define TRX_LOOP INT MODE ENABLE_NINT_MASK (0x3ff)

#define TRX_LOOP INT MODE ENABLE_IB1V_LOMIXER_POS (29)
#define TRX_LOOP INT MODE ENABLE_IB1V_LOMIXER_MASK (0x3)

#define TRX_LOOP INT MODE ENABLE_INT_MODE_POS (31)
#define TRX_LOOP INT MODE ENABLE_INT_MODE_MASK (0x1)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_ADDR (SOC_TRX_REG_BASE + (0x5 << 2))

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_NSDMLSB_POS (0)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_NSDMLSB_MASK (0xff)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_CKSEL_SDM_POS (8)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_CKSEL_SDM_MASK (0x3)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VCTRL_CAL_POS (10)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VCTRL_CAL_MASK (0x1)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_LO_POS (11)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_LO_MASK (0x7)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_PNEN_POS (14)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_PNEN_MASK (0x1)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_SDM_RSTN_POS (15)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_SDM_RSTN_MASK (0x1)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_PLLLDO_POS (16)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_PLLLDO_MASK (0x7)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VCTRL_CAL_POS (19)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VCTRL_CAL_MASK (0x1)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_CPLDO_POS (20)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_VSEL1V_CPLDO_MASK (0x1f)

#define TRX_SET THE FREQUENCY CHANNEL BY SPI_CHSPI_POS (25)
#define TRX_SET THE FREQUENCY CHANNEL BY SPI_CHSPI_MASK (0x7f)

#define TRX_DCOC I PATH INPUT_ADDR (SOC_TRX_REG_BASE + (0x6 << 2))

#define TRX_DCOC I PATH INPUT_DPD_EN_POS (0)
#define TRX_DCOC I PATH INPUT_DPD_EN_MASK (0x1)

#define TRX_DCOC I PATH INPUT_NC_1_1_POS (1)
#define TRX_DCOC I PATH INPUT_NC_1_1_MASK (0x1)

#define TRX_DCOC I PATH INPUT_RX3S_POS (2)
#define TRX_DCOC I PATH INPUT_RX3S_MASK (0x1)

#define TRX_DCOC I PATH INPUT_NC_3_3_POS (3)
#define TRX_DCOC I PATH INPUT_NC_3_3_MASK (0x1)

#define TRX_DCOC I PATH INPUT_NC_4_9_POS (4)
#define TRX_DCOC I PATH INPUT_NC_4_9_MASK (0x3f)

#define TRX_DCOC I PATH INPUT_NC_10_15_POS (10)
#define TRX_DCOC I PATH INPUT_NC_10_15_MASK (0x3f)

#define TRX_DCOC I PATH INPUT_DCOCQ_POS (16)
#define TRX_DCOC I PATH INPUT_DCOCQ_MASK (0xff)

#define TRX_DCOC I PATH INPUT_DCOCI_POS (24)
#define TRX_DCOC I PATH INPUT_DCOCI_MASK (0xff)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_ADDR (SOC_TRX_REG_BASE + (0x7 << 2))

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DIG_DCOEN_POS (0)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DIG_DCOEN_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_SPILPFRXG_POS (1)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_SPILPFRXG_MASK (0xf)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_AUTORXIFGEN_POS (5)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_AUTORXIFGEN_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DCOC_CTL_POS (6)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DCOC_CTL_MASK (0x3)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXGS_POS (8)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXGS_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFTXTEST_G_POS (9)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFTXTEST_G_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_ADC_CKINV_POS (10)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_ADC_CKINV_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_G_POS (11)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_G_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_ABWS_EN_POS (12)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_ABWS_EN_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFTXTEST_B_POS (13)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFTXTEST_B_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_B_POS (14)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_B_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_BLE_POS (15)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_TXIF_2RD_BLE_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_ISEL_BUF_POS (16)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_ISEL_BUF_MASK (0x7)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_ISEL_OPA_POS (19)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_ISEL_OPA_MASK (0x7)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_DELAY_POS (22)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_DELAY_MASK (0x1f)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_CK_EDGE_POS (27)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_DAC_CK_EDGE_MASK (0x1)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFCAPCALQ_H2B_POS (28)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFCAPCALQ_H2B_MASK (0x3)

#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFCAPCALI_H2B_POS (30)
#define TRX_LPF I PATH CALIBIRATION INPUT (HIGH 2BITS)_LPFCAPCALI_H2B_MASK (0x3)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_ADDR (SOC_TRX_REG_BASE + (0x8 << 2))

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_LOTRIGSPI_POS (0)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_LOTRIGSPI_MASK (0x1)

