bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RFPLL_NOTCH_RES_POS (1)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RFPLL_NOTCH_RES_MASK (0x7f)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_EN_WIFIPLL_POS (8)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_EN_WIFIPLL_MASK (0x1)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_GRSSI_B_POS (9)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_GRSSI_B_MASK (0x1)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_GRSSI_W_POS (10)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_GRSSI_W_MASK (0x1)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_IBS_POS (11)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_IBS_MASK (0x3)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_TSEL_POS (13)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_TSEL_MASK (0x3)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_TEN_POS (15)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_TEN_MASK (0x1)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_BLE_POS (16)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSI_BLE_MASK (0xf)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITL_POS (20)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITL_MASK (0xf)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITM_POS (24)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITM_MASK (0xf)

#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITH_POS (28)
#define TRX_RSSI HIGH THRESHOLD FOR WIFI_RSSITH_MASK (0xf)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ADDR (SOC_TRX_REG_BASE + (0x9 << 2))

#define TRX_LNA LOAD  CAPACITOR TUNNING_AGCRXFEEN_POS (0)
#define TRX_LNA LOAD  CAPACITOR TUNNING_AGCRXFEEN_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_GRXLNASPI_POS (1)
#define TRX_LNA LOAD  CAPACITOR TUNNING_GRXLNASPI_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_GRXI2VSPI_POS (3)
#define TRX_LNA LOAD  CAPACITOR TUNNING_GRXI2VSPI_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_VBSRXLO_POS (5)
#define TRX_LNA LOAD  CAPACITOR TUNNING_VBSRXLO_MASK (0x7)

#define TRX_LNA LOAD  CAPACITOR TUNNING_IBSRXI2V_POS (8)
#define TRX_LNA LOAD  CAPACITOR TUNNING_IBSRXI2V_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_VLOFASTSEL_POS (10)
#define TRX_LNA LOAD  CAPACITOR TUNNING_VLOFASTSEL_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ENCLIP_POS (11)
#define TRX_LNA LOAD  CAPACITOR TUNNING_ENCLIP_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ENFSR_POS (12)
#define TRX_LNA LOAD  CAPACITOR TUNNING_ENFSR_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_VSLNALDO_POS (13)
#define TRX_LNA LOAD  CAPACITOR TUNNING_VSLNALDO_MASK (0x7)

#define TRX_LNA LOAD  CAPACITOR TUNNING_GLNAR_POS (16)
#define TRX_LNA LOAD  CAPACITOR TUNNING_GLNAR_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_V2IS_POS (18)
#define TRX_LNA LOAD  CAPACITOR TUNNING_V2IS_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_LNAIS_POS (20)
#define TRX_LNA LOAD  CAPACITOR TUNNING_LNAIS_MASK (0x3)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ATT_SPI_POS (22)
#define TRX_LNA LOAD  CAPACITOR TUNNING_ATT_SPI_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ATT_MANU_EN_POS (23)
#define TRX_LNA LOAD  CAPACITOR TUNNING_ATT_MANU_EN_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_INR_POS (24)
#define TRX_LNA LOAD  CAPACITOR TUNNING_INR_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_LGLC_POS (25)
#define TRX_LNA LOAD  CAPACITOR TUNNING_LGLC_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_R_TUNE_POS (26)
#define TRX_LNA LOAD  CAPACITOR TUNNING_R_TUNE_MASK (0x1)

#define TRX_LNA LOAD  CAPACITOR TUNNING_ISRXREF_POS (27)
#define TRX_LNA LOAD  CAPACITOR TUNNING_ISRXREF_MASK (0x7)

#define TRX_LNA LOAD  CAPACITOR TUNNING_CLOADLNA_POS (30)
#define TRX_LNA LOAD  CAPACITOR TUNNING_CLOADLNA_MASK (0x3)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_ADDR (SOC_TRX_REG_BASE + (0xa << 2))

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNC_POS (0)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNC_MASK (0x3)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNL_POS (2)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNL_MASK (0x3)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNH_POS (4)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_DYGS_VBNH_MASK (0x3)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PABIASCGM_POS (6)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PABIASCGM_MASK (0x1)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VDLS_POS (7)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VDLS_MASK (0x7)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VDHS_POS (10)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VDHS_MASK (0x7)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA__VBPAS_POS (13)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA__VBPAS_MASK (0xf)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VBNLS_POS (17)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VBNLS_MASK (0xf)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VBNHS_POS (21)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_VBNHS_MASK (0xf)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENDYC_POS (25)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENDYC_MASK (0x1)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENCSDYL_POS (26)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENCSDYL_MASK (0x1)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENCSDYH_POS (27)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_ENCSDYH_MASK (0x1)

#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_DIBIASBG_POS (28)
#define TRX_MSB OF PROGRAMMING OF PA CURRENT  100UA + 25UA*#LSB, LSB AT REG11 BIT17_PA_DIBIASBG_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_ADDR (SOC_TRX_REG_BASE + (0xb << 2))

