bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCD_POS (0)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCD_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCC_POS (4)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCC_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCB_POS (8)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCB_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCA_POS (12)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PADCA_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_HVDHS_POS (16)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_HVDHS_MASK (0x1)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_DIA_POS (17)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_DIA_MASK (0x1)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_DMODLDOSEL_POS (18)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_DMODLDOSEL_MASK (0x7)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_DICS_POS (21)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_DICS_MASK (0x3)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_DI_POS (23)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_DI_MASK (0xf)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_ENCAPDY_POS (27)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_PAD_ENCAPDY_MASK (0x1)

#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_MODCA_POS (28)
#define TRX_MODULATOR OUTPUT TUNING CAP PROGRAMMING: +18FF/LSB (LOW Q NODES)_MODCA_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_ADDR (SOC_TRX_REG_BASE + (0xc << 2))

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_GMGAIN_POS (0)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_GMGAIN_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PADCTRL_POS (4)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PADCTRL_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PACTRL_POS (8)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PACTRL_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_RGM_POS (12)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_RGM_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_DGMDC_POS (16)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_DGMDC_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_MIXVSWB_POS (20)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_MIXVSWB_MASK (0x3)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_MIXVBH_POS (22)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_MIXVBH_MASK (0x3)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PA_DIBIASPT_POS (24)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PA_DIBIASPT_MASK (0xf)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PA_CAP_POS (28)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PA_CAP_MASK (0x7)

#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PAMAPEN_POS (31)
#define TRX_(0: SPI;  1: DIGITAL) POWER CONTROL ENABLE_PAMAPEN_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_ADDR (SOC_TRX_REG_BASE + (0xd << 2))

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_IPATCS_POS (0)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_IPATCS_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TSSIQRG_POS (1)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TSSIQRG_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_VREF_VBGS_POS (4)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_VREF_VBGS_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_VB_VDDGS_POS (5)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_VB_VDDGS_MASK (0x3)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TSSIRANGES_POS (7)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TSSIRANGES_MASK (0x3)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_EN_PCAL_POS (9)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_EN_PCAL_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_EN_IQCAL_POS (10)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_EN_IQCAL_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_ITAS_POS (11)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_ITAS_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_RCCALEN_POS (12)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_RCCALEN_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_DYOPBIAS_POS (13)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PA_DYOPBIAS_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_RXLO LDO_POS (16)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_RXLO LDO_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_HVDLS_POS (19)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_HVDLS_MASK (0x1)

