bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_ENPADCAPBIAS_POS (20)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_ENPADCAPBIAS_MASK (0x1)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PAD_CAPBIASS_POS (21)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_PAD_CAPBIASS_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TXLO LDO_POS (24)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_TXLO LDO_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_LDODA_POS (27)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_LDODA_MASK (0x7)

#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_IPATCS_POS (30)
#define TRX_MSB OF PA CURRENT BIAS TEMPERATURE  SETTING , ANOTHER BITS AT 0X00[0]_IPATCS_MASK (0x3)

#define TRX_NC_ADDR (SOC_TRX_REG_BASE + (0xe << 2))

#define TRX_NC_DYGS_VBNC_2_POS (0)
#define TRX_NC_DYGS_VBNC_2_MASK (0x3)

#define TRX_NC_DYGS_VBNL_2_POS (2)
#define TRX_NC_DYGS_VBNL_2_MASK (0x3)

#define TRX_NC_DYGS_VBNH_2_POS (4)
#define TRX_NC_DYGS_VBNH_2_MASK (0x3)

#define TRX_NC_PABIASCGM_2_POS (6)
#define TRX_NC_PABIASCGM_2_MASK (0x1)

#define TRX_NC_PA_VDLS_2_POS (7)
#define TRX_NC_PA_VDLS_2_MASK (0x7)

#define TRX_NC_PA_VDHS_2_POS (10)
#define TRX_NC_PA_VDHS_2_MASK (0x7)

#define TRX_NC_PA__VBPAS_2_POS (13)
#define TRX_NC_PA__VBPAS_2_MASK (0xf)

#define TRX_NC_PA_VBNLS_2_POS (17)
#define TRX_NC_PA_VBNLS_2_MASK (0xf)

#define TRX_NC_PA_VBNHS_2_POS (21)
#define TRX_NC_PA_VBNHS_2_MASK (0xf)

#define TRX_NC_PA_ENDYC_2_POS (25)
#define TRX_NC_PA_ENDYC_2_MASK (0x1)

#define TRX_NC_PA_ENCSDYL_2_POS (26)
#define TRX_NC_PA_ENCSDYL_2_MASK (0x1)

#define TRX_NC_PA_ENCSDYH_2_POS (27)
#define TRX_NC_PA_ENCSDYH_2_MASK (0x1)

#define TRX_NC_NC_28_31_POS (28)
#define TRX_NC_NC_28_31_MASK (0xf)

#define TRX_0 = REST; 1=NORMAL WORK_ADDR (SOC_TRX_REG_BASE + (0x12 << 2))

#define TRX_0 = REST; 1=NORMAL WORK_IOPS_POS (0)
#define TRX_0 = REST; 1=NORMAL WORK_IOPS_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_FICTL_POS (1)
#define TRX_0 = REST; 1=NORMAL WORK_FICTL_MASK (0x7)

#define TRX_0 = REST; 1=NORMAL WORK_CGMBS_POS (4)
#define TRX_0 = REST; 1=NORMAL WORK_CGMBS_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_LDOIFSEL_POS (5)
#define TRX_0 = REST; 1=NORMAL WORK_LDOIFSEL_MASK (0x7)

#define TRX_0 = REST; 1=NORMAL WORK_ENCLIP_FLT_POS (8)
#define TRX_0 = REST; 1=NORMAL WORK_ENCLIP_FLT_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_ENFSR_FLT_POS (9)
#define TRX_0 = REST; 1=NORMAL WORK_ENFSR_FLT_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_FLAGSEL_POS (10)
#define TRX_0 = REST; 1=NORMAL WORK_FLAGSEL_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_LDOAD_POS (11)
#define TRX_0 = REST; 1=NORMAL WORK_LDOAD_MASK (0x7)

#define TRX_0 = REST; 1=NORMAL WORK_ADC_ISEL_POS (14)
#define TRX_0 = REST; 1=NORMAL WORK_ADC_ISEL_MASK (0x7)

#define TRX_0 = REST; 1=NORMAL WORK_DLYPC_I_POS (17)
#define TRX_0 = REST; 1=NORMAL WORK_DLYPC_I_MASK (0x3)

#define TRX_0 = REST; 1=NORMAL WORK_TDTUNE_I_POS (19)
#define TRX_0 = REST; 1=NORMAL WORK_TDTUNE_I_MASK (0x3f)

#define TRX_0 = REST; 1=NORMAL WORK_TDTUNEB_POS (25)
#define TRX_0 = REST; 1=NORMAL WORK_TDTUNEB_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_CALEN_POS (26)
#define TRX_0 = REST; 1=NORMAL WORK_CALEN_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_CALNSEL_POS (27)
#define TRX_0 = REST; 1=NORMAL WORK_CALNSEL_MASK (0x3)

#define TRX_0 = REST; 1=NORMAL WORK_CKMODE_POS (29)
#define TRX_0 = REST; 1=NORMAL WORK_CKMODE_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_VREFS_POS (30)
#define TRX_0 = REST; 1=NORMAL WORK_VREFS_MASK (0x1)

#define TRX_0 = REST; 1=NORMAL WORK_ADC_RSTN_POS (31)
#define TRX_0 = REST; 1=NORMAL WORK_ADC_RSTN_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_ADDR (SOC_TRX_REG_BASE + (0x13 << 2))

#define TRX_CELL DELAY CONTROL SPI VALUE_LPFOUTTSTEN_POS (0)
#define TRX_CELL DELAY CONTROL SPI VALUE_LPFOUTTSTEN_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LPFINTSTEN_POS (1)
#define TRX_CELL DELAY CONTROL SPI VALUE_LPFINTSTEN_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_ATSEL_POS (2)
#define TRX_CELL DELAY CONTROL SPI VALUE_ATSEL_MASK (0x3)

#define TRX_CELL DELAY CONTROL SPI VALUE_ENTST_POS (4)
#define TRX_CELL DELAY CONTROL SPI VALUE_ENTST_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_NC_5_5_POS (5)
#define TRX_CELL DELAY CONTROL SPI VALUE_NC_5_5_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOVCTRL_TESTEN_POS (6)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOVCTRL_TESTEN_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOVCTRLSEL_POS (7)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOVCTRLSEL_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_TRSW_BT_MODE_POS (8)
#define TRX_CELL DELAY CONTROL SPI VALUE_TRSW_BT_MODE_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_BTPLL_EN_SPI_POS (9)
#define TRX_CELL DELAY CONTROL SPI VALUE_BTPLL_EN_SPI_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_NC_10_10_POS (10)
#define TRX_CELL DELAY CONTROL SPI VALUE_NC_10_10_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_T0R1_SPI_POS (11)
#define TRX_CELL DELAY CONTROL SPI VALUE_T0R1_SPI_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOTRIGCTR_POS (12)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOTRIGCTR_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOSEL_RX_POS (13)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOSEL_RX_MASK (0x3)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOSELVCTR_POS (15)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOSELVCTR_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_LOSEL0DIG_POS (16)
#define TRX_CELL DELAY CONTROL SPI VALUE_LOSEL0DIG_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_CKMODE_PWD_POS (17)
#define TRX_CELL DELAY CONTROL SPI VALUE_CKMODE_PWD_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_VBIAS_ADC_POS (18)
#define TRX_CELL DELAY CONTROL SPI VALUE_VBIAS_ADC_MASK (0x1f)

#define TRX_CELL DELAY CONTROL SPI VALUE_DLYPC_I_POS (23)
#define TRX_CELL DELAY CONTROL SPI VALUE_DLYPC_I_MASK (0x3)

#define TRX_CELL DELAY CONTROL SPI VALUE_NC_25_25_POS (25)
#define TRX_CELL DELAY CONTROL SPI VALUE_NC_25_25_MASK (0x1)

#define TRX_CELL DELAY CONTROL SPI VALUE_TDTUNE_Q_POS (26)
#define TRX_CELL DELAY CONTROL SPI VALUE_TDTUNE_Q_MASK (0x3f)

