bekencorp/bk_idk/middleware/soc/bk7236n/soc/trx_reg.h
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_ADDR (SOC_TRX_REG_BASE + (0x14 << 2))

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_NC_0_0_POS (0)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_NC_0_0_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_NC_1_1_POS (1)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_NC_1_1_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_WIFI_LOEN_POS (2)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_WIFI_LOEN_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_DIFFN_POS (3)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_DIFFN_MASK (0xffffff)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_PNEN_POS (27)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_PNEN_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_IF2M_POS (28)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_IF2M_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_RXLO_POS (29)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_RXLO_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_CKSEL_SDM_POS (30)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_CKSEL_SDM_MASK (0x1)

#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_CK2SDMPOL_SEL_POS (31)
#define TRX_CLOCK(TO SDM) POLARITY SELECTION.
          0:  NEGEDGE 
          1:  POSEDGE_CK2SDMPOL_SEL_MASK (0x1)

#define TRX__ADDR (SOC_TRX_REG_BASE + (0x15 << 2))

#define TRX__RESET_NLOAD_POS (0)
#define TRX__RESET_NLOAD_MASK (0x1)

#define TRX__TRISTATE_POS (1)
#define TRX__TRISTATE_MASK (0x1)

#define TRX__SELPOL_POS (2)
#define TRX__SELPOL_MASK (0x1)

#define TRX__NC_3_7_POS (3)
#define TRX__NC_3_7_MASK (0x1f)

#define TRX__CP1_RX_POS (8)
#define TRX__CP1_RX_MASK (0xf)

#define TRX__RP3_RX_POS (12)
#define TRX__RP3_RX_MASK (0xf)

#define TRX__RP2_RX_POS (16)
#define TRX__RP2_RX_MASK (0xf)

#define TRX__RP1_RX_POS (20)
#define TRX__RP1_RX_MASK (0x1f)

#define TRX__IOFFSET_RX_POS (25)
#define TRX__IOFFSET_RX_MASK (0x3)

#define TRX__ICP_RX_POS (27)
#define TRX__ICP_RX_MASK (0xf)

#define TRX__CK_NLOAD_EDGESEL_POS (31)
#define TRX__CK_NLOAD_EDGESEL_MASK (0x1)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._ADDR (SOC_TRX_REG_BASE + (0x16 << 2))

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._VREFLCTRL_POS (0)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._VREFLCTRL_MASK (0x3)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._VREFHCTRL_POS (2)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._VREFHCTRL_MASK (0x3)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._RESET_NCOUNTER_POS (4)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._RESET_NCOUNTER_MASK (0x1)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._NC_5_28_POS (5)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._NC_5_28_MASK (0xffffff)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._PWD5G_POS (29)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._PWD5G_MASK (0x1)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._PWD2G_POS (30)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._PWD2G_MASK (0x1)

#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._BP_OPT_POS (31)
#define TRX_BAND CALIBRATION OPTIMIZE ENABLE._BP_OPT_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_ADDR (SOC_TRX_REG_BASE + (0x17 << 2))

#define TRX_N VALUE SPI CONTROL_RCTRL_POS (0)
#define TRX_N VALUE SPI CONTROL_RCTRL_MASK (0xf)

#define TRX_N VALUE SPI CONTROL_PWD_VCOAMPCAL_POS (4)
#define TRX_N VALUE SPI CONTROL_PWD_VCOAMPCAL_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_RXLOCTRL_VCOCAL_POS (5)
#define TRX_N VALUE SPI CONTROL_RXLOCTRL_VCOCAL_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_DONE_DELAY_POS (6)
#define TRX_N VALUE SPI CONTROL_DONE_DELAY_MASK (0x7)

#define TRX_N VALUE SPI CONTROL_SPI_TRIGGER_POS (9)
#define TRX_N VALUE SPI CONTROL_SPI_TRIGGER_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_ERRDET_SPIEN_POS (10)
#define TRX_N VALUE SPI CONTROL_ERRDET_SPIEN_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_CKREF_LOOP_SEL_POS (11)
#define TRX_N VALUE SPI CONTROL_CKREF_LOOP_SEL_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_CKREF_NL_SEL_POS (12)
#define TRX_N VALUE SPI CONTROL_CKREF_NL_SEL_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_NRSTEN_POS (13)
#define TRX_N VALUE SPI CONTROL_NRSTEN_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_INT_MOD_POS (14)
#define TRX_N VALUE SPI CONTROL_INT_MOD_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_BAND_MEN_POS (15)
#define TRX_N VALUE SPI CONTROL_BAND_MEN_MASK (0x1)

#define TRX_N VALUE SPI CONTROL_BAND_SPI_POS (16)
#define TRX_N VALUE SPI CONTROL_BAND_SPI_MASK (0xff)

#define TRX_N VALUE SPI CONTROL_NMANUAL_POS (24)
#define TRX_N VALUE SPI CONTROL_NMANUAL_MASK (0xff)

#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._ADDR (SOC_TRX_REG_BASE + (0x18 << 2))

#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._NC_0_19_POS (0)
#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._NC_0_19_MASK (0xfffff)

#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOBIAS_MEN_POS (20)
#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOBIAS_MEN_MASK (0x1)

#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOBIAS_SPI_POS (21)
#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOBIAS_SPI_MASK (0x3f)

#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOAMPDET_POS (27)
#define TRX_VCO AMPLITUDE AUTO CALIBRATION THRESHOLD CONTROL.._VCOAMPDET_MASK (0x1f)

#define TRX__ADDR (SOC_TRX_REG_BASE + (0x19 << 2))

#define TRX__NC_0_1_POS (0)
#define TRX__NC_0_1_MASK (0x3)

#define TRX__BWCTRL_POS (2)
#define TRX__BWCTRL_MASK (0x1)

#define TRX__NC_3_3_POS (3)
#define TRX__NC_3_3_MASK (0x1)

#define TRX__VCOHPEN_POS (4)
#define TRX__VCOHPEN_MASK (0x1)

#define TRX__NC_5_12_POS (5)
#define TRX__NC_5_12_MASK (0xff)

#define TRX__VCAL_SEL_POS (13)
#define TRX__VCAL_SEL_MASK (0x3)

#define TRX__NC_15_20_POS (15)
#define TRX__NC_15_20_MASK (0x3f)

#define TRX__VSEL1V_VCO_POS (21)
#define TRX__VSEL1V_VCO_MASK (0x7)

#define TRX__VSEL1V_PLL_POS (24)
#define TRX__VSEL1V_PLL_MASK (0x7)

#define TRX__VSEL1V_CP_POS (27)
#define TRX__VSEL1V_CP_MASK (0x7)

#define TRX__NC_30_30_POS (30)
#define TRX__NC_30_30_MASK (0x1)

#define TRX__CK26M_40M_SEL_POS (31)
#define TRX__CK26M_40M_SEL_MASK (0x1)

#define TRX__ADDR (SOC_TRX_REG_BASE + (0x1a << 2))

#define TRX__NC_0_31_POS (0)
#define TRX__NC_0_31_MASK (0xffffffff)

#ifdef __cplusplus
}
#endif
